results/bun/express.txt
Bundle: 821.9 KB
Startup: 111.9 ms
Memory before: 75.9 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     75978.28   11359.00   89141.06
  Latency        6.59ms     1.89ms   105.37ms
  HTTP codes:
    1xx - 0, 2xx - 757255, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    17.61MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     69944.32    9122.89   81408.05
  Latency        7.15ms   801.21us    65.92ms
  HTTP codes:
    1xx - 0, 2xx - 696894, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    17.40MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     49969.04    6548.10   60088.02
  Latency       10.00ms     1.13ms    57.22ms
  HTTP codes:
    1xx - 0, 2xx - 498742, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    16.58MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       305.52     148.17     517.04
  Latency       32.69ms     5.20ms    88.02ms
  HTTP codes:
    1xx - 0, 2xx - 3065, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.03GB/s

Memory after: 221.7 MB