results/bun/hono.txt
Bundle: 21.4 KB
Startup: 67.9 ms
Memory before: 48.7 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    214363.40   34463.48  251663.56
  Latency        2.34ms     1.06ms   113.63ms
  HTTP codes:
    1xx - 0, 2xx - 2132222, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    36.39MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    149826.72   19535.21  170468.57
  Latency        3.34ms   535.08us    72.09ms
  HTTP codes:
    1xx - 0, 2xx - 1491223, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    31.42MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    146557.21   18594.71  164211.70
  Latency        3.41ms   588.06us    72.96ms
  HTTP codes:
    1xx - 0, 2xx - 1457326, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    37.38MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[==================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      1784.65     433.56    2492.88
  Latency        5.60ms     2.02ms    43.82ms
  HTTP codes:
    1xx - 0, 2xx - 17850, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    23.52GB/s

Memory after: 95.3 MB